In [5]:
import pandas as pd

In [44]:
movies = pd.read_csv('movies.csv.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [46]:
ratings = pd.read_csv('ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [47]:
ratings_count = ratings[ratings['rating'] == 5.0].groupby('movieId').count().sort_values('rating', ascending=False).head(1)
ratings_count = ratings_count.reset_index(level='movieId')
ratings_count

   movieId  userId  rating  timestamp
0      318     153     153        153

In [48]:
print('Фильм, на который оставили больше всего отзывов с рейтингов 5.0:', movies['title'].loc[movies['movieId'] == ratings_count['movieId'][0]])

Фильм, на который оставили больше всего отзывов с рейтингов 5.0: 277    Shawshank Redemption, The (1994)
Name: title, dtype: object

In [51]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [53]:
def baltic(country):
    
    if country in ['Lithuania', 'Latvia', 'Estonia']:
        return 'Прибалтика'
    
    return 'Other'

In [54]:
power['baltic'] = power.country.apply(baltic)
#power.baltic.value_counts()
power.head()

   country  year  quantity  category baltic
0  Austria  1996       5.0         1  Other
1  Austria  1995      17.0         1  Other
2  Belgium  2014       0.0         1  Other
3  Belgium  2013       0.0         1  Other
4  Belgium  2012      35.0         1  Other

In [55]:
print('В период с 2005 по 2010 год в странах Прибалтики было потрачено следующее кол-во электроэнергии:',
      power['quantity'].loc[(2005 <= power['year']) & (power['year'] <= 2010) & (power['baltic'] == 'Прибалтика') & (power['quantity'] >= 0)].sum())

В период с 2005 по 2010 год в странах Прибалтики было потрачено следующее кол-во электроэнергии: 26034247.620774537

In [58]:
data = pd.read_html('https://fortrader.org/quotes')[2]
data.head()

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0       Золото Цена золота на бирже  1 805       3.00          0.00        NaN
1  Серебро Цена на серебро на бирже  22.50       0.05          0.20        NaN
2         Палладий Цена на Палладий  1 775      37.00          2.00        NaN
3           Платина Цены на платину    934       5.00          1.00        NaN
4           Медь Цена меди на бирже   4.29      -0.00         -0.02        NaN